#+setupfile: org.setup

#+name: fix_path
#+begin_src python :exports none :results output
# This allows execution from the docs/ directory
import sys
if '../' not in sys.path:
    sys.path.insert(0, '../')
#+end_src

#+results: fix_path

** A minimal simulation backend

We set up a bare-bones simulation backend building on the native System class
#+begin_src python
from atooms.system import System

class BareBonesBackend(object):
    
    def __init__(self):
        self.system = System()

    def run(self, steps):
        for i in range(steps):
            pass

# The backend is created and wrapped by a simulation object.
# Here we first call the run() method then run_until()
from atooms.simulation import Simulation
from atooms.simulation.core import _log as logger
backend = BareBonesBackend()
simulation = Simulation(backend)
simulation.run(10)
simulation.run_until(30)
assert simulation.current_step == 30

# This time we call run() multiple times 
simulation = Simulation(backend)
simulation.run(10)
simulation.run(20)
assert simulation.current_step == 30  

# Set up verbose logging to see a meaningful log
from atooms.core.utils import setup_logging
setup_logging(level=20, update=True)
simulation = Simulation(backend)
simulation.run(10)
setup_logging(level=40, update=True)
#+end_src

#+results:
#+begin_example
# 
# atooms simulation via <__main__.BareBonesBackend object at 0x7f6f4f8e1430>
# 
# version: 3.14.1+3.14.1-7-g7ec3c6-dirty (2022-12-10)
# atooms version: 3.14.1+3.14.1-7-g7ec3c6-dirty (2022-12-10)
# simulation started on: 2022-12-21 at 11:04
# output path: None
# backend: <class '__main__.BareBonesBackend'>
# 
# target target_steps: 10
# 
# 
# <__main__.BareBonesBackend object at 0x7f6f4f8e1430>
# simulation ended successfully: reached target steps 10
# 
# final steps: 10
# final rmsd: 0.00
# wall time [s]: 0.00
# average TSP [s/step/particle]: nan
# simulation ended on: 2022-12-21 at 11:04
#+end_example

** Fine-tuning the scheduler

Calling a callback can be done at regular intervals during the simulation or according to a custom schedule defined by a =Scheduler=. Here we consider the =simulation.write_trajectory()= callback, which writes the system state in a trajectory file
#+begin_src python
from atooms.trajectory import TrajectoryXYZ
from atooms.simulation import write_trajectory, Scheduler

simulation = Simulation(RandomWalk(system))
trajectory = TrajectoryXYZ('/tmp/trajectory.xyz', 'w')
# Write every 10 steps
simulation.add(write_trajectory, Scheduler(10), trajectory=trajectory)
#+end_src

#+results:

Here are a few options of the Scheduler:

- =interval=: notify at a fixed steps interval (default)
- =calls=: fixed number of calls to the callback
- =steps=: list of steps at which the callback will be called
- =block=: as steps, but the callback will be called periodically
- =seconds=: notify every =seconds=

One useful application of the Scheduler is writing frames in a trajectory at exponentialy spaced intervals. Here the
#+begin_src python
trajectory_exp = TrajectoryXYZ('/tmp/trajectory_exp.xyz', 'w')
simulation.add(write_trajectory, Scheduler(block=[0, 1, 2, 4, 8, 16]), trajectory=trajectory_exp)
simulation.run(32)
trajectory.close()
trajectory_exp.close()
#+end_src

#+results:

Now we will have two trajectories, one with regular and the other with exponentially spaced blocks of frames
#+begin_src python
with TrajectoryXYZ('/tmp/trajectory.xyz') as th, \
     TrajectoryXYZ('/tmp/trajectory_exp.xyz') as th_exp:
    print('Regular:', th.steps)
    print('Exponential:', th_exp.steps)
#+end_src

#+results:
: Regular: [0, 10, 20, 30]
: Exponential: [0, 1, 2, 4, 8, 16, 17, 18, 20, 24, 32]

** Compute statistical averages

The =simulation.store()= callback allows you to store data in a dictionary while the simulation is running. Here are a few ways to use it to perform some statistical analysis.

The =store= callback accepts an array of arguments to store. They can be string matching a few predefined attributes (such as =steps=, the current number of steps carried out by the backend) or a general attribute of the =simulation= instance (such as =system.particle[0].position[0]=, the x-coordinate of the first particle of the system).
#+begin_src python
import numpy
from atooms.simulation import store

simulation = Simulation(RandomWalk(system))
simulation.add(store, 1, ['steps', 'system.particle[0].position[0]'])
#+end_src

#+results:

By default, after running the simulation, the data will be stored in the =simulation.data= dictionary and you can use it for further analysis
#+begin_src python
import numpy
simulation.run(10)
print(numpy.mean(simulation.data['system.particle[0].position[0]']))
#+end_src

#+results:
: 2.493414801026613

You can store the result of any function that takes as first argument the simulation instance. Just add a tuple with a label and the function to the list of properties to store.
#+begin_src python
simulation = Simulation(RandomWalk(system))
simulation.add(store, 1, ['steps', ('x_1', lambda sim: sim.system.particle[1].position[0])])
simulation.run(10)
#+end_src

#+results:

** Molecular dynamics with RUMD

There is native support for an efficient MD molecular dynamics code running entirely on GPU called [[https://rumd.org][RUMD]], developed by the Glass and Time group in Roskilde. It is optimized for small and medium-size systems.

Here we pick the last frame of the trajectory, change the density of the system to unity and write this new configuration to a trajectory format suitable for RUMD
#+begin_src python
from atooms.trajectory import Trajectory

with Trajectory('/tmp/lj_N1000_rho1.0.xyz') as trajectory:
    system = trajectory[-1]
    system.density = 1.0
    print('New density:', round(len(system.particle) / system.cell.volume, 2))

from atooms.trajectory import TrajectoryRUMD
with TrajectoryRUMD('rescaled.xyz.gz', 'w') as trajectory:
    trajectory.write(system)
#+end_src

#+results:
: New density: 1.0

Now we run a short molecular dynamics simulation with the =RUMD= backend, using a Lennard-Jones potential:
#+begin_src python :eval no
import rumd
from atooms.backends.rumd import RUMD
from atooms.simulation import Simulation

potential = rumd.Pot_LJ_12_6(cutoff_method=rumd.ShiftedPotential)
potential.SetParams(i=0, j=0, Epsilon=1.0, Sigma=1.0, Rcut=2.5)
backend = RUMD('rescaled.xyz.gz', [potential], integrator='nve'
sim = Simulation(backend)
sim.run(1000)
#+end_src

A repository of interaction models for simple liquids and glasses is available in the [[https://framagit.org/atooms/models][atooms-models]] component package. It generates RUMD potentials automatically from standardized json file or Python dictionaries.
